In [158]:
import numpy as np
import pandas as pd
import sklearn.datasets
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [159]:
df=pd.read_csv(r'petrol.csv')

In [160]:
df.head()

        city        date   rate      state
0  Hyderabad  2011-12-01  73.07  Telangana
1  Hyderabad  2012-04-01  73.08  Telangana
2  Hyderabad  2012-05-24  81.44  Telangana
3  Hyderabad  2012-06-03  78.11  Telangana
4  Hyderabad  2012-06-29  74.89  Telangana

In [161]:
df.tail()

        city        date  rate        state
5043  Mumbai  2020-12-27  90.3  Maharashtra
5044  Mumbai  2020-12-28  90.3  Maharashtra
5045  Mumbai  2020-12-29  90.3  Maharashtra
5046  Mumbai  2020-12-30  90.3  Maharashtra
5047  Mumbai  2020-12-31  90.3  Maharashtra

In [162]:
df['state'].unique()

array(['Telangana', 'Karnataka', 'Delhi', 'Tamil Nadu', 'Maharashtra'],
      dtype=object)

In [163]:
df['city'].unique()

array(['Hyderabad', 'Bengaluru', 'Delhi', 'Chennai', 'Mumbai'],
      dtype=object)

In [164]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5048 entries, 0 to 5047
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   city    5048 non-null   object
 1   date    5048 non-null   object
 2   rate    5048 non-null   float64
 3   state   5048 non-null   object
dtypes: float64(1), object(3)
memory usage: 157.9+ KB

In [165]:
df.describe

<bound method NDFrame.describe of            city        date   rate        state
0     Hyderabad  2011-12-01  73.07    Telangana
1     Hyderabad  2012-04-01  73.08    Telangana
2     Hyderabad  2012-05-24  81.44    Telangana
3     Hyderabad  2012-06-03  78.11    Telangana
4     Hyderabad  2012-06-29  74.89    Telangana
...         ...         ...    ...          ...
5043     Mumbai  2020-12-27  90.30  Maharashtra
5044     Mumbai  2020-12-28  90.30  Maharashtra
5045     Mumbai  2020-12-29  90.30  Maharashtra
5046     Mumbai  2020-12-30  90.30  Maharashtra
5047     Mumbai  2020-12-31  90.30  Maharashtra

[5048 rows x 4 columns]>

In [166]:
df.shape

(5048, 4)

In [167]:
df.isnull().sum()

city     0
date     0
rate     0
state    0
dtype: int64

In [168]:
df.isna().sum()

city     0
date     0
rate     0
state    0
dtype: int64

In [169]:
df.rename(columns = {'date':'date_day'}, inplace = True)

In [170]:
df.date_day = pd.to_datetime(df.date_day)

In [171]:
df["date"] = df['date_day'].dt.day

In [172]:
df["month"] = df['date_day'].dt.month

In [173]:
df["year"] = df['date_day'].dt.year

In [174]:
df.head()

        city   date_day   rate      state  date  month  year
0  Hyderabad 2011-12-01  73.07  Telangana     1     12  2011
1  Hyderabad 2012-04-01  73.08  Telangana     1      4  2012
2  Hyderabad 2012-05-24  81.44  Telangana    24      5  2012
3  Hyderabad 2012-06-03  78.11  Telangana     3      6  2012
4  Hyderabad 2012-06-29  74.89  Telangana    29      6  2012

In [180]:
df.drop(['date_day'],inplace=True,axis = 1)

In [181]:
df.head()

  city   rate state  date  month  year
0    0  73.07     0     1     12  2011
1    0  73.08     0     1      4  2012
2    0  81.44     0    24      5  2012
3    0  78.11     0     3      6  2012
4    0  74.89     0    29      6  2012

In [182]:
df["state"].replace({"Telangana": "0", "Karnataka": "1","Delhi":"2","Tamil Nadu":"3","Maharashtra":"4"}, inplace=True)

In [183]:
df["city"].replace({"Hyderabad": "0", "Bengaluru": "1","Delhi":"2","Chennai":"3","Mumbai":"4"}, inplace=True)

In [184]:
df.head()

  city   rate state  date  month  year
0    0  73.07     0     1     12  2011
1    0  73.08     0     1      4  2012
2    0  81.44     0    24      5  2012
3    0  78.11     0     3      6  2012
4    0  74.89     0    29      6  2012

In [185]:
X = df.drop(columns='rate', axis=1)
Y = df['rate']

In [186]:
X

     city state  date  month  year
0       0     0     1     12  2011
1       0     0     1      4  2012
2       0     0    24      5  2012
3       0     0     3      6  2012
4       0     0    29      6  2012
...   ...   ...   ...    ...   ...
5043    4     4    27     12  2020
5044    4     4    28     12  2020
5045    4     4    29     12  2020
5046    4     4    30     12  2020
5047    4     4    31     12  2020

[5048 rows x 5 columns]

In [187]:
Y

0       73.07
1       73.08
2       81.44
3       78.11
4       74.89
        ...
5043    90.30
5044    90.30
5045    90.30
5046    90.30
5047    90.30
Name: rate, Length: 5048, dtype: float64

In [188]:
X.shape

(5048, 5)

In [189]:
Y.shape

(5048,)

In [190]:
X_train, X_test, Y_train, Y_test = train_test_split(X, Y, test_size = 0.23)

In [191]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()
model = reg.fit(X_train, Y_train)
ypr = model.predict(X_test)
model.score(X_test, Y_test)

0.6014601501985604

In [192]:
from sklearn.neighbors import KNeighborsRegressor
classifier = KNeighborsRegressor(n_neighbors=5)
classifier.fit(X_train, Y_train)

KNeighborsRegressor()

In [193]:
model1=classifier
y_pred = classifier.predict(X_test)
print(y_pred)

[75.096 78.876 79.32  ... 81.898 73.154 69.516]

In [194]:
classifier.score(X_train, Y_train)

0.9170741167945674

In [195]:
from sklearn.ensemble import RandomForestRegressor
reg_rf = RandomForestRegressor()
reg_rf.fit(X_train, Y_train)

RandomForestRegressor()

In [196]:
y_pred = reg_rf.predict(X_test)

In [197]:
reg_rf.score(X_train, Y_train)

0.9981958820258037

In [198]:
import pickle
with open('class.pkl','wb') as f:
    pickle.dump(reg_rf,f)
    f.close()
classifier = pickle.load(open('class.pkl', 'rb'))